// --створити масив та вивести його в консоль:
// - з 5 числових значень
// const  numArray = [2, 4, 10, 15, 50];
// console.log(numArray);


// - з 5 стічкових значень
// const strArray = ['Viktoriia', 'Bogdan', 'Volodymyr', 'Svitlana', 'Pavlo'];
// console.log(strArray);

// - з 5 значень стрічкового, числового та булевого типу
//
// const mixArray = ['Monday', 'Pavlo', 18, true, false, undefined, NaN, 'false'];
// console.log(mixArray);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до
// конкретного індексу. Вивести в консоль.
//
// let emptyArray = [];
//
// emptyArray[0] = 'Hi';
// emptyArray[1] = true;
// emptyArray[2] = 'Ho ho';
// emptyArray[3] = {name: 'Viktoriia', age: 36};
// emptyArray[4] = 12;
// emptyArray[6] = NaN;
// emptyArray[7] = () => {
//     console.log('Hello,world')
// };
// emptyArray[8] = '15';
// emptyArray[11] = undefined;
//
// console.log(emptyArray);


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = 0; i < 10; i++) {
//   document.write('<div>Hello world</div>');
// }


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і
// індексом всередині
//
// for (let i = 0; i < 10; i++) {
//     document.write('<div>Hello world: ' + i +' </div>');
//     document.write(`<div>Hello world: ${i} </div>`);
// }


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//
// let i = 0;
// while (i < 20) {
//     document.write('<h1>Hello Ok10</h1>');
//     i++;
// }



// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//
// let i = 0;
// while (i < 20) {
//     // document.write('<h1>Hello Ok10: '+ i +' </h1>');
//     document.write(`<h1> Hello Ok10: ${i} </h1>`);
//     i++;
// }



// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.


// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.


// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if
// та typeof вивести тільки булеві елементи


// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години  (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
